In [1]:
# isna, notna, fillna, dropna!

In [2]:
import numpy as np
import pandas as pd

In [3]:
# np.nan : not a number
data = {
    'name' : ['Rahul', 'Sakshi', None, 'Dhaval', 'Aniket', None],
    'age' : [20, np.nan, 30, 40, np.nan, 100],
    'city' : [None, 'NYC', 'canada', 'USA', None, 'Ahmedabad']
}

In [4]:
data

{'name': ['Rahul', 'Sakshi', None, 'Dhaval', 'Aniket', None],
 'age': [20, nan, 30, 40, nan, 100],
 'city': [None, 'NYC', 'canada', 'USA', None, 'Ahmedabad']}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

     name    age       city
0   Rahul   20.0       None
1  Sakshi    NaN        NYC
2    None   30.0     canada
3  Dhaval   40.0        USA
4  Aniket    NaN       None
5    None  100.0  Ahmedabad

In [7]:
# check if the value is available or not

In [8]:
df.isna() # is not available ? True : False

    name    age   city
0  False  False   True
1  False   True  False
2   True  False  False
3  False  False  False
4  False   True   True
5   True  False  False

In [9]:
# Get the sum of not available values from each column

In [10]:
df.isna().sum()

name    2
age     2
city    2
dtype: int64

In [11]:
# notna : not not available

In [12]:
df.notna() #

    name    age   city
0   True   True  False
1   True  False   True
2  False   True   True
3   True   True   True
4   True  False  False
5  False   True   True

### The difference between isna and notna method!

#### isna : returns true for not available values, and returns false for available values 
#### notna : returns true for available values, and returns false for not avaiable values

In [13]:
# fillna : fill not available!

In [14]:
df

     name    age       city
0   Rahul   20.0       None
1  Sakshi    NaN        NYC
2    None   30.0     canada
3  Dhaval   40.0        USA
4  Aniket    NaN       None
5    None  100.0  Ahmedabad

In [15]:
df['name'] = df['name'].fillna('unknown')

In [16]:
df

      name    age       city
0    Rahul   20.0       None
1   Sakshi    NaN        NYC
2  unknown   30.0     canada
3   Dhaval   40.0        USA
4   Aniket    NaN       None
5  unknown  100.0  Ahmedabad

In [18]:
df['age'] = df['age'].fillna(df['age'].mean())

In [26]:
df['test'] = np.nan

In [27]:
df

      name    age       city  test
0    Rahul   20.0       None   NaN
1   Sakshi   47.5        NYC   NaN
2  unknown   30.0     canada   NaN
3   Dhaval   40.0        USA   NaN
4   Aniket   47.5       None   NaN
5  unknown  100.0  Ahmedabad   NaN

In [21]:
# drop the values!

In [29]:
# all : it will remove/drop entire index/row or column of datafram if all data is not available / showing absence of data 
# any : it will remove/drop entire index/row or column of dataframe if at least one data is found as nan/none
df.dropna(how="any", axis="columns")

      name    age
0    Rahul   20.0
1   Sakshi   47.5
2  unknown   30.0
3   Dhaval   40.0
4   Aniket   47.5
5  unknown  100.0

In [30]:
# how : all or any
# axis : index or columns